app/controllers/from_arduinos_controller.rb

  def index
    @from_arduinos = FromArduino.all
---
SELECT "from_arduinos".* FROM "from_arduinos"

  def create
    @from_arduino = FromArduino.new(from_arduino_params)

    respond_to do |format|
      if @from_arduino.save
---
INSERT INTO "from_arduinos" ("value", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["value", "0,0,0"], ["created_at", "2019-12-04 23:33:40.114398"], ["updated_at", "2019-12-04 23:33:40.114398"]]

  def update
    respond_to do |format|
      if @from_arduino.update(from_arduino_params)
---
UPDATE "from_arduinos" SET "value" = $1, "updated_at" = $2 WHERE "from_arduinos"."id" = $3  [["value", "1,20,34,90,0,2"], ["updated_at", "2019-12-05 12:13:34.401950"], ["id", 3]]

    def set_from_arduino
      @from_arduino = FromArduino.find(params[:id])
---
SELECT "from_arduinos".* FROM "from_arduinos" WHERE "from_arduinos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]