app/controllers/home_controller.rb

  def index
    @to_arduinos = ToArduino.last
    if @to_arduinos.nil?
      @to_arduinos = "-,-,-"
    end
    @from_arduinos = FromArduino.last
---
SELECT "from_arduinos".* FROM "from_arduinos" ORDER BY "from_arduinos"."id" DESC LIMIT $1  [["LIMIT", 1]]