app/controllers/to_arduinos_controller.rb

  def index
    @to_arduinos = ToArduino.all
---
SELECT "to_arduinos".* FROM "to_arduinos"

  def create
    to_arduinos = ToArduino.all
    to_arduinos.each do |ta|
      ta.destroy
    end
    #@to_arduino = ToArduino.new(to_arduino_params)
    @to_arduino = ToArduino.new(value: to_arduino_params[:x] + "," + to_arduino_params[:y] + "," + to_arduino_params[:z])

    respond_to do |format|
      if @to_arduino.save
---
SELECT "to_arduinos".* FROM "to_arduinos"
INSERT INTO "to_arduinos" ("value", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["value", "holaaafondfgodfgndifgni,laaaMapiEsLaMEjor,111111"], ["created_at", "2019-12-05 02:19:24.518422"], ["updated_at", "2019-12-05 02:19:24.518422"]]

    def set_to_arduino
      @to_arduino = ToArduino.find(params[:id])
---
SELECT "to_arduinos".* FROM "to_arduinos" WHERE "to_arduinos"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]